IDEA Open Model
ConcreteULSCheckResultFatigue Properties
Compatible with IDEA StatiCa Beta 20.0
The ConcreteULSCheckResultFatigue type exposes the following members.
Properties
Name | Description
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Top
See Also
Reference
ConcreteULSCheckResultFatigue Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace